export default {
  systemTitle: '码了个 bug',
  banner: {
    title: '👋 嘿，欢迎来到 Next.js 起步模板!',
    more: '了解详情',
  },

  badgeTitle: '轻量级、开箱即用 🎉',
  featureSupport: `🔥 现在支持 {{feature}}！`,
  lastUpdated: '最后更新于:',

  getStarted: '开始使用',

  featureList: [
    {
      title: '先进的技术栈',
      description: '高效的 React (v19) 框架，使用 Next.js、Nextra(v4) 和 Shadcn UI 打造现代化应用',
    },
    {
      title: '国际化支持 (i18n)',
      description: '内置多语言支持，轻松实现应用的国际化，扩大用户群体',
    },
    {
      title: 'TypeScript 类型安全',
      description:
        '全面集成 TypeScript，提供静态类型检查，减少运行时错误，提高代码可靠性和可维护性',
    },
    {
      title: 'Iconify 图标集',
      description: '纯 CSS 图标, 集成 Iconify 图标集，提供丰富的图标选择，增强 UI 视觉表现',
    },
    {
      title: 'Tailwind CSS (v4)',
      description: '使用原子化 CSS 框架 Tailwind CSS，快速构建高效设计、响应式界面 UI',
    },
    {
      title: '代码规范',
      description: '遵循最佳实践的代码规范，结合 ESLint 进行代码质量检查与一致性维护',
    },
    {
      title: '暗黑模式',
      description: '支持暗黑模式，提供更好的夜间使用体验',
    },
    {
      title: '丰富组件 & 支持自由扩展',
      description: '提供丰富的预置组件，并支持灵活的自定义扩展',
    },
    {
      title: '轻量化设计',
      description: '采用轻量化设计，精简项目设置，专注于内容编写',
    },
  ],
  featuresDesc: '如果以下项目对你有帮助或者对这个项目感兴趣，欢迎Star⭐️⭐️⭐️',
  faqs: [
    {
      question: '这个启动模板支持哪些框架和技术栈？',
      answer:
        '本启动模板支持 Next.js 和 Nextra，并集成了 Tailwind CSS、Framer Motion、Shadcn UI 组件等现代开发技术栈。',
    },
    {
      question: '我如何开始使用这个模板进行开发？',
      answer:
        '只需克隆我们的 GitHub 仓库并按照文档中的步骤运行安装命令，即可开始使用本模板进行开发。',
    },
    {
      question: '这个模板适合哪些类型的项目？',
      answer:
        '该模板适合用于创建快速、高效的现代 Web 应用程序，包括企业站点、个人博客、电子商务平台等。',
    },
    {
      question: '如何添加或修改项目中的组件？',
      answer: '可以使用提供的组件库，按照文档中的说明进行自定义和扩展，以适应您的具体需求。',
    },
    {
      question: '模板是否提供多语言支持？',
      answer:
        '是的，模板内置国际化 (i18n) 功能，可以轻松添加和管理多语言内容，扩大应用的国际用户群。',
    },
    {
      question: '如何获得技术支持或帮助？',
      answer: '如果在使用过程中遇到问题，请通过 GitHub @pdsuwwz 与我们联系。',
    },
  ],
  projectList: [
    {
      name: 'online-edit-web', // 项目名称
      github: 'https://github.com/xun082/online-edit-web',
      link: 'https://online-edit-web.vercel.app/',
      image: 'https://online-edit-web.vercel.app/images/home.png',
      status: '已完成',
      description: '一款集成AI能力的Online IDE，提供开箱即用的开发环境，简化开发过程，提高效率',
      tags: ['react', 'next', 'Tailwindcss', 'TypeScript', 'shadcn', 'zustand', 'swr'],
    },
    {
      name: 'create-neat', // 项目名称
      github: 'https://github.com/xun082/create-neat',
      link: '',
      image: '',
      status: '已完成',
      description:
        'Create-Neat 是一款轻量级脚手架工具，专为提供 开箱即用和 零配置体验而设计，旨在帮助用户快速且轻松地构建项目，同时支持多样的技术栈选择。',
      tags: ['webpack', 'vite', 'eslint', 'react', 'vue', 'prettier'],
    },
    {
      name: 'create-neat2', // 项目名称
      github: 'https://github.com/xun082/create-neat',
      link: '',
      image: '',
      status: '已完成',
      description: 'Create-Neat 是一款轻量级脚手架工具，专为提供 开箱即用和 零配置体验而设计',
      tags: ['webpack', 'vite', 'eslint', 'react', 'vue', 'prettier'],
    },
  ],
};
